In [2]:
import numpy as np
import pandas as pd

In [106]:
dictionary = {
    "Bmw" : 300000,
    "Mercedes" : 500000,
    "Tofaş" : 20000
}

In [107]:
pd.Series(dictionary)

Bmw         300000
Mercedes    500000
Tofaş        20000
dtype: int64

In [108]:
arr = np.array([50,40,30])
pd.Series(arr)

0    50
1    40
2    30
dtype: int32

In [109]:
isim = ["Ömer","Sinem","Gece"]
yas = [18,18,1]

In [110]:
pd.Series(yas,isim)

Ömer     18
Sinem    18
Gece      1
dtype: int64

In [111]:
pd.Series(data=yas,index=isim)

Ömer     18
Sinem    18
Gece      1
dtype: int64

In [112]:
yarisma_1 = pd.Series([10,20,30],["Gece","Ömer","Sinem"])
yarisma_2 = pd.Series([1,50,20],["Gece","Ömer","Sinem"])

In [113]:
yarisma_1 + yarisma_2

Gece     11
Ömer     70
Sinem    50
dtype: int64

In [114]:
data = np.array(np.random.randint(1,100,9)).reshape(3,3)
data

array([[92, 29, 43],
       [77, 72, 49],
       [39, 49,  1]])

In [115]:
data_frame = pd.DataFrame(data)
data_frame

    0   1   2
0  92  29  43
1  77  72  49
2  39  49   1

In [116]:
new_data_frame = pd.DataFrame(data,index=["Sinem","Ömer","Gece"],columns=["Yaş","Maaş","Çalışma Saati"])
new_data_frame

       Yaş  Maaş  Çalışma Saati
Sinem   92    29             43
Ömer    77    72             49
Gece    39    49              1

In [117]:
new_data_frame["Yaş"]

Sinem    92
Ömer     77
Gece     39
Name: Yaş, dtype: int32

In [118]:
new_data_frame["Yaş"]["Sinem"]

92

In [119]:
new_data_frame.loc["Sinem"]

Yaş              92
Maaş             29
Çalışma Saati    43
Name: Sinem, dtype: int32

In [120]:
new_data_frame.iloc[0]

Yaş              92
Maaş             29
Çalışma Saati    43
Name: Sinem, dtype: int32

In [121]:
new_data_frame.loc[["Sinem","Ömer"]]

       Yaş  Maaş  Çalışma Saati
Sinem   92    29             43
Ömer    77    72             49

In [122]:
new_data_frame.loc[["Sinem","Ömer"]][["Yaş","Maaş"]]

       Yaş  Maaş
Sinem   92    29
Ömer    77    72

In [123]:
new_data_frame["Günlük Çalışma Saati"] = new_data_frame["Çalışma Saati"] / 7

In [124]:
new_data_frame

       Yaş  Maaş  Çalışma Saati  Günlük Çalışma Saati
Sinem   92    29             43              6.142857
Ömer    77    72             49              7.000000
Gece    39    49              1              0.142857

In [125]:
new_data_frame.drop("Günlük Çalışma Saati",axis=1)

       Yaş  Maaş  Çalışma Saati
Sinem   92    29             43
Ömer    77    72             49
Gece    39    49              1

In [126]:
new_data_frame.drop("Gece",axis=0)

       Yaş  Maaş  Çalışma Saati  Günlük Çalışma Saati
Sinem   92    29             43              6.142857
Ömer    77    72             49              7.000000

In [127]:
new_data_frame.drop("Günlük Çalışma Saati",axis=1,inplace=True)

In [128]:
new_data_frame

       Yaş  Maaş  Çalışma Saati
Sinem   92    29             43
Ömer    77    72             49
Gece    39    49              1

In [129]:
new_data_frame[new_data_frame["Yaş"] > 10]

       Yaş  Maaş  Çalışma Saati
Sinem   92    29             43
Ömer    77    72             49
Gece    39    49              1

In [130]:
new_data_frame["Yaş"] > 10

Sinem    True
Ömer     True
Gece     True
Name: Yaş, dtype: bool

In [131]:
new_data_frame > 10

        Yaş  Maaş  Çalışma Saati
Sinem  True  True           True
Ömer   True  True           True
Gece   True  True          False

In [132]:
new_data_frame["Yeni index listesi"] = ["Düno","Fox","Mal"]
new_data_frame

       Yaş  Maaş  Çalışma Saati Yeni index listesi
Sinem   92    29             43               Düno
Ömer    77    72             49                Fox
Gece    39    49              1                Mal

In [133]:
new_data_frame.set_index("Yeni index listesi",inplace=True)

In [134]:
new_data_frame.reset_index(inplace=True)

In [135]:
new_data_frame

  Yeni index listesi  Yaş  Maaş  Çalışma Saati
0               Düno   92    29             43
1                Fox   77    72             49
2                Mal   39    49              1

In [136]:
new_data_frame.loc[3] = ["Paşa",10,100,5]

In [137]:
new_data_frame

  Yeni index listesi  Yaş  Maaş  Çalışma Saati
0               Düno   92    29             43
1                Fox   77    72             49
2                Mal   39    49              1
3               Paşa   10   100              5

In [138]:
data = list(zip(["Korkmaz","Korkmaz","Güngör","Güngör"],["Sinem","Ömer","Gece","Paşa"]))
data

[('Korkmaz', 'Sinem'),
 ('Korkmaz', 'Ömer'),
 ('Güngör', 'Gece'),
 ('Güngör', 'Paşa')]

In [139]:
indeksler = pd.MultiIndex.from_tuples(data)

In [140]:
data_1 = np.array([[18,"19-07-2003"],[18,"19-05-2003"],[2,"19-01-2021"],[1,"18-06-2021"]])
data_1

array([['18', '19-07-2003'],
       ['18', '19-05-2003'],
       ['2', '19-01-2021'],
       ['1', '18-06-2021']], dtype='<U11')

In [141]:
SoyDataFrame = pd.DataFrame(data_1,index=indeksler,columns=["Yaş","Doğum Günü"])
SoyDataFrame

              Yaş  Doğum Günü
Korkmaz Sinem  18  19-07-2003
        Ömer   18  19-05-2003
Güngör  Gece    2  19-01-2021
        Paşa    1  18-06-2021

In [142]:
SoyDataFrame.index.names = ["Soy","İsim"]
SoyDataFrame

              Yaş  Doğum Günü
Soy     İsim
Korkmaz Sinem  18  19-07-2003
        Ömer   18  19-05-2003
Güngör  Gece    2  19-01-2021
        Paşa    1  18-06-2021

In [143]:
SoyDataFrame.loc["Korkmaz"]

      Yaş  Doğum Günü
İsim
Sinem  18  19-07-2003
Ömer   18  19-05-2003

In [144]:
sozluk = {"Ankara":[3,-4,-4,np.nan],"İstanbul":[2,np.nan,3,2],"İzmir":[5,4,4,4],"Antalya":[np.nan,8,9,np.nan]}
data_frame = pd.DataFrame(sozluk,index=["Cumartesi","Pazar","Pazartesi","Salı"])
data_frame

           Ankara  İstanbul  İzmir  Antalya
Cumartesi     3.0       2.0      5      NaN
Pazar        -4.0       NaN      4      8.0
Pazartesi    -4.0       3.0      4      9.0
Salı          NaN       2.0      4      NaN

In [145]:
data_frame.dropna()

           Ankara  İstanbul  İzmir  Antalya
Pazartesi    -4.0       3.0      4      9.0

In [146]:
data_frame.dropna(axis=1)

           İzmir
Cumartesi      5
Pazar          4
Pazartesi      4
Salı           4

In [147]:
data_frame.dropna(axis=1,thresh=2) #Niye işe yaramadı aq

           Ankara  İstanbul  İzmir  Antalya
Cumartesi     3.0       2.0      5      NaN
Pazar        -4.0       NaN      4      8.0
Pazartesi    -4.0       3.0      4      9.0
Salı          NaN       2.0      4      NaN

In [148]:
data_frame.fillna("-")

          Ankara İstanbul  İzmir Antalya
Cumartesi    3.0      2.0      5       -
Pazar       -4.0        -      4     8.0
Pazartesi   -4.0      3.0      4     9.0
Salı           -      2.0      4       -

In [149]:
maaslar = {"Departman":["Front-End","Front-End","Front-End","Back-End","Back-End","Full-Stack"],
          "İsimler" : ["ahmet","mehmet","aslı","selim","necip","taci"],
          "Maaş" : [45,24,13,457,121,35]}
df = pd.DataFrame(maaslar)
df

    Departman İsimler  Maaş
0   Front-End   ahmet    45
1   Front-End  mehmet    24
2   Front-End    aslı    13
3    Back-End   selim   457
4    Back-End   necip   121
5  Full-Stack    taci    35

In [150]:
df_groupby = df.groupby("Departman")
df_groupby.describe()

            Maaş
           count        mean         std    min    25%    50%    75%    max
Departman
Back-End     2.0  289.000000  237.587878  121.0  205.0  289.0  373.0  457.0
Front-End    3.0   27.333333   16.258331   13.0   18.5   24.0   34.5   45.0
Full-Stack   1.0   35.000000         NaN   35.0   35.0   35.0   35.0   35.0

In [151]:
df_groupby.mean("Maaş")

                  Maaş
Departman
Back-End    289.000000
Front-End    27.333333
Full-Stack   35.000000

In [152]:
df["Yaş"] = [22,26,22,19,32,30]
df

    Departman İsimler  Maaş  Yaş
0   Front-End   ahmet    45   22
1   Front-End  mehmet    24   26
2   Front-End    aslı    13   22
3    Back-End   selim   457   19
4    Back-End   necip   121   32
5  Full-Stack    taci    35   30

In [153]:
df_groupby.describe()

            Maaş                                                             \
           count        mean         std    min    25%    50%    75%    max
Departman
Back-End     2.0  289.000000  237.587878  121.0  205.0  289.0  373.0  457.0
Front-End    3.0   27.333333   16.258331   13.0   18.5   24.0   34.5   45.0
Full-Stack   1.0   35.000000         NaN   35.0   35.0   35.0   35.0   35.0

             Yaş
           count       mean       std   min    25%   50%    75%   max
Departman
Back-End     2.0  25.500000  9.192388  19.0  22.25  25.5  28.75  32.0
Front-End    3.0  23.333333  2.309401  22.0  22.00  22.0  24.00  26.0
Full-Stack   1.0  30.000000       NaN  30.0  30.00  30.0  30.00  30.0

In [154]:
df_groupby.mean("Maaş")

                  Maaş
Departman
Back-End    289.000000
Front-End    27.333333
Full-Stack   35.000000

In [155]:
data_frame["Antalya"].isnull()

Cumartesi     True
Pazar        False
Pazartesi    False
Salı          True
Name: Antalya, dtype: bool

In [158]:
df["Departman"] = df["Departman"] + " " + df["Maaş"].astype(str)
df

       Departman İsimler  Maaş  Yaş
0   Front-End 45   ahmet    45   22
1   Front-End 24  mehmet    24   26
2   Front-End 13    aslı    13   22
3   Back-End 457   selim   457   19
4   Back-End 121   necip   121   32
5  Full-Stack 35    taci    35   30

In [165]:
a = df["Departman"].str.replace("^[a-zA-Z-]+","").astype(int)
a

C:\Users\Fox\AppData\Local\Temp\ipykernel_6676\3857118911.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  a = df["Departman"].str.replace("^[a-zA-Z-]+","").astype(int)

0     45
1     24
2     13
3    457
4    121
5     35
Name: Departman, dtype: int32

       Departman İsimler  Maaş  Yaş
0   Front-End 45   ahmet    45   22
1   Front-End 24  mehmet    24   26
2   Front-End 13    aslı    13   22
3   Back-End 457   selim   457   19
4   Back-End 121   necip   121   32
5  Full-Stack 35    taci    35   30

In [3]:
new_df = pd.read_csv("netflix.csv")
new_df["duration"].str.replace("[\w]+$","").fillna(0).astype(int)

C:\Users\Fox\AppData\Local\Temp\ipykernel_5340\4161590384.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  new_df["duration"].str.replace("[\w]+$","").fillna(0).astype(int)

0        90
1         2
2         1
3         1
4         2
       ...
8802    158
8803      2
8804     88
8805     88
8806    111
Name: duration, Length: 8807, dtype: int32

In [32]:
a = new_df["duration"].to_string().replace(" ","").replace("\n"," ")
dicts = dict()
for i in a:
    if i in dicts:
        dicts[i] += 1
    else:
        dicts[i] = 1
print(dicts)

{'0': 4248, '9': 4499, 'm': 6128, 'i': 6128, 'n': 8804, ' ': 8806, '1': 9709, '2': 5276, 'S': 2676, 'e': 2676, 'a': 2679, 's': 3559, 'o': 2676, '3': 4877, '4': 4635, '5': 4613, '6': 4667, '7': 4652, '8': 4809, 'N': 6}